print('====================================')
print('회원가입')
print('====================================')

while True:
    print('회원가입을 진행하시겠습니까?')
    print('   y: 진행        n: 취소')
    answer=input('>> ')
    # 입력된 문자 중 대문자를 소문자로 변경하는 함수
    answer=answer.lower()
    if answer == 'y':
        print('====================================')
        print('회원가입이 진행됩니다.')
        print('====================================')
        break
    elif answer == 'n':
        print('====================================')
        print('회원가입이 취소합니다.')
        print('====================================')
        exit()
    else:
        print("'y' 또는 'n'을 입력해주세요.")